int/resources/objectRepo/xmlTemplates/opera/OperaExchangeInterfaceConfig/req_ChangeInterfaceControls.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/oxi/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:ChangeInterfaceControlsRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:IntegrationSystem/>
         <v9:InterfaceControls>
            <v91:InterfaceControl ConversionType="?" DisplayName="?" EditAllowed="?" HotelCode="?" LevelCode="?" LevelType="?" Name="?" Scope="?" Sequence="?" Type="?" Value="?" ValueType="?">
               <v91:ShortDescription/>
               <v91:Description/>
               <v91:WildCardMatch/>
               <v91:Settings>
                  <v91:Setting ConversionType="?" DisplayName="?" EditAllowed="?" HotelCode="?" Name="?" Scope="?" Sequence="?" Type="?" Value="?" ValueType="?">
                     <v91:ShortDescription/>
                     <v91:Description/>
                     <v91:WildCardMatch/>
                  </v91:Setting>
               </v91:Settings>
               <v91:InterfaceID/>
               <v91:UseGlobal/>
               <v91:OxiParameterGroup/>
            </v91:InterfaceControl>
         </v9:InterfaceControls>
      </v9:ChangeInterfaceControlsRQ>
   </soapenv:Body>
</soapenv:Envelope>